---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AreaBasedLoadData.AreaBasedLoadType
source: html/e9f29bc9-9f9b-4c7f-579f-fc5b5516e369.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadData.AreaBasedLoadType Property

The electrical area based load type of the area based load.

## Syntax (C#)
```csharp
public ElementId AreaBasedLoadType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - When setting this property: The id isn't a valid area based load type.
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null